@section('contentTitle')
<h3>Due Date Reminders Helper</h3>
@endsection

@section('content')

<div class="card">

    <div class="card-body">
        <dl>
            <dt>
                নোট১ঃ Due Date Reminder module টি এমনভাবে ডিজাইন করা হয়েছে যাতে আপনি প্রতিমাসে কাস্টমারের কাছে
                সয়ংক্রিয়ভাবে
                বিল
                ডিউ এর নোটিশ পাঠাতে পারেন।
            </dt>
            <hr>
            <dt>
                নোট২ঃ মেসেজ টি এমনভাবে লিখবেন, যাতে এটি পরবর্তী মাসের জন্যও প্রযোজ্য হয়।
            </dt>
            <hr>
            <dt>
                নোট৩ঃ বাংলায় মেসেজ লিখলে অবশ্যই ইউনিকোডে লিখবেন।
            </dt>
            <hr>
            <dt>
                ধরা যাক, আপনার কিছু কাস্টমারের প্যাকেজের মেয়াদ ১০ তারিখের মধ্যে শেষ হয়ে যাবে বা ১০ তারিখে তাদের লাস্ট
                পেমেন্ট ডেট এবং আপনি তাদেরকে ৯ তারিখে বিলের নোটিশ পাঠাতে চান।
                তাহলে Due Date Reminder তৈরি করতে নিচের স্টেপগুলো অনুসরণ করুনঃ
            </dt>
            <dd>
                <ul>
                    <li>
                        <span class="text-danger"> Last Date of Payment/Expiration Date : </span> calendar এ ১০ তারিখ
                        সিলেক্ট করুন ।
                    </li>
                    <li>
                        <span class="text-danger"> Notification Date : </span> calendar এ ৯ তারিখ সিলেক্ট করুন ।
                    </li>
                    <li>
                        <span class="text-danger"> Send Automatically? : </span> প্রতিমাসে কাস্টমারের কাছে সয়ংক্রিয়ভাবে
                        বিল
                        ডিউ এর নোটিশ পাঠাতে yes সিলেক্ট করুন ।
                    </li>
                    <li>
                        <span class="text-danger"> Text Message : </span> এখানে কাস্টমারের কাছে যে মেসেজটি পাঠাতে চান তা
                        লিখুন । মেসেজ এর মধ্যে যদি লাস্ট পেমেন্ট ডেট উল্লেখ করতে চান তাহলে ডেট এর জায়গায় <span
                            class="text-danger">[payment_date] </span>
                        ভেরিয়েবল টি লিখুন। ধরুন আপনি জানুয়ারি মাসে মেসেজটি লিখছেন তাহলে জানুয়ারি মাসে [payment_date]
                        ভেরিয়েবল এর জায়গায় ১০-০১-২০২১ অটোমেটিকেলি বসবে,
                        আবার মেসেজটি যখন ফেব্রুয়ারি মাসে যাবে তখন [payment_date] ভেরিয়েবল এর জায়গায় ১০-০২-২০২১
                        অটোমেটিকেলি
                        বসবে। তাই মেসেজটি পরবর্তী বছর বা মাসের জন্য পরিবর্তন করার প্রয়োজন হবে না।

                    </li>
                </ul>
            </dd>
            <hr>
            <dt> Generate Defaults button এ ক্লিক করলে আপনি অটোমেটিক্যালি জেনারেটেড রিমাইন্ডার এর প্রিভিউ দেখতে পাবেন ।
                এই
                রিমাইন্ডারগুলো সেভ করে রাখতে ঐ পেজের নিচে থাকা সেভ বাটনে ক্লিক করুন। </dt>

            <hr>
            <dt>বুজতে সমস্যা হলে আমাদের হেল্পলাইন নাম্বারে যোগাযোগ করুন। </dt>

        </dl>
    </div>

</div>

@endsection

@section('pageJs')
@endsection
